[
    {
        "user_id": "u101",
        "home_id": "Fo7IG9",
        "comment": "The apartment was clean and cozy, with everything we needed for a weekend stay. The kitchen was well equipped and allowed us to cook a couple of meals easily. We especially enjoyed the quiet at night, which made sleeping very comfortable. I would highly recommend it to couples looking for a calm and convenient place in the city.",
        "rating": 4.8
    },
    {
        "user_id": "u102",
        "home_id": "Fo7IG9",
        "comment": "Loved the modern design and central location, everything was within walking distance. The host was very responsive and gave us great tips for restaurants nearby. The bed was comfortable, and the Wi-Fi was reliable, which was perfect since I had to work a bit during the stay. I’d recommend it to anyone who wants a stylish and practical spot in town.",
        "rating": 4.9
    },
    {
        "user_id": "u103",
        "home_id": "Lm3BR4",
        "comment": "Spacious rooms and a warm host made our stay really pleasant. The neighborhood was quiet, and we always felt safe walking around even at night. The living room was large enough for our kids to play in, which made it stress-free for us as parents. It’s definitely a great choice for families who want comfort and peace of mind.",
        "rating": 4.7
    },
    {
        "user_id": "u104",
        "home_id": "Lm3BR4",
        "comment": "The place was bright and airy, with lots of natural light in the mornings. We loved having easy access to public transport, which made sightseeing effortless. The host even left us a small welcome gift, which was a really nice touch. I’d recommend this home for business travelers or families who want space without sacrificing convenience.",
        "rating": 4.6
    },
    {
        "user_id": "u105",
        "home_id": "gV1",
        "comment": "Amazing view of Gran Vía! We enjoyed breakfast on the balcony every morning and watched the city come alive. The interior was stylish yet cozy, and it truly felt like a boutique stay. I would absolutely recommend this apartment to couples looking for romance in the heart of Madrid.",
        "rating": 5.0
    },
    {
        "user_id": "u106",
        "home_id": "gV1",
        "comment": "The apartment was comfortable and beautifully decorated, with lots of attention to detail. The location could not have been better, we had theaters, shops, and restaurants all around us. The bed was super soft, and we slept wonderfully each night. I would recommend it to anyone who wants to experience the real energy of the city while still having a relaxing retreat.",
        "rating": 4.9
    },
    {
        "user_id": "u107",
        "home_id": "Rk8MN2",
        "comment": "Very clean and well-maintained, with everything working perfectly. The host was welcoming and made sure we felt at home from the very first moment. We stayed for almost a week and it was comfortable the entire time. This home is a fantastic option for longer stays where you want both reliability and warmth.",
        "rating": 4.8
    },
    {
        "user_id": "u108",
        "home_id": "Rk8MN2",
        "comment": "Nice place with modern amenities, and the fast Wi-Fi was a big plus for me since I was working remotely. The neighborhood was quiet, but we could still find cafes and shops nearby within a short walk. Everything felt very new and clean, and the bathroom was especially nice. I would recommend it to digital nomads or anyone who values comfort and functionality.",
        "rating": 4.7
    },
    {
        "user_id": "u109",
        "home_id": "Fo7IG9",
        "comment": "The apartment felt like home from the moment we walked in. Everything was spotless, and the design was thoughtful with small touches that made a big difference. We really appreciated the extra blankets since it got chilly at night. I’d highly recommend this place to anyone who values comfort and cleanliness.",
        "rating": 4.8
    },
    {
        "user_id": "u110",
        "home_id": "Fo7IG9",
        "comment": "Location was absolutely perfect, close to shops, cafes, and the main attractions. The bed was very comfortable, and the living room was spacious enough for us to relax after sightseeing. We felt like locals thanks to the great neighborhood vibe. Definitely recommend it for travelers wanting both comfort and convenience.",
        "rating": 4.9
    },
    {
        "user_id": "u111",
        "home_id": "Fo7IG9",
        "comment": "What a gem! The apartment was well equipped, and the host made sure to provide everything we needed. We especially loved the fast Wi-Fi and the cozy living space. This is a place I’d recommend for both short and long stays without hesitation.",
        "rating": 4.7
    },
    {
        "user_id": "u112",
        "home_id": "Fo7IG9",
        "comment": "Very clean and well maintained, and the decor was charming. The location was excellent, giving us easy access to everything. The quiet atmosphere was perfect for resting after long days of exploring. I would recommend it to anyone seeking a peaceful stay in a central area.",
        "rating": 4.8
    },
    {
        "user_id": "u113",
        "home_id": "Fo7IG9",
        "comment": "We had a lovely time here, the apartment was bright and felt very welcoming. The host provided great local tips that made our trip even better. Everything worked perfectly, from the appliances to the heating. I’d recommend this spot to couples looking for a romantic getaway.",
        "rating": 4.9
    },
    {
        "user_id": "u114",
        "home_id": "Lm3BR4",
        "comment": "A spacious and inviting home with everything we needed for our family holiday. The kids had plenty of room to play, and we enjoyed relaxing in the evenings. The kitchen made cooking easy, which saved us money during the trip. I would recommend this house to families who want space and comfort.",
        "rating": 4.7
    },
    {
        "user_id": "u115",
        "home_id": "Lm3BR4",
        "comment": "The neighborhood was peaceful and had a local charm. The host was extremely friendly and always available to help when we had questions. The house was tidy and had all the essentials, which made our stay stress-free. Highly recommended for anyone looking for a quiet escape.",
        "rating": 4.6
    },
    {
        "user_id": "u116",
        "home_id": "Lm3BR4",
        "comment": "We loved how open and airy the space felt. Natural light filled every room, which really lifted our mood. Everything was clean, and the furniture was comfortable. I’d recommend it especially for groups or families who need room to spread out.",
        "rating": 4.8
    },
    {
        "user_id": "u117",
        "home_id": "Lm3BR4",
        "comment": "Great house with lots of thoughtful touches from the host. The beds were comfortable, and the bathrooms were spotless. We also liked having a big dining area to share meals together. I would definitely stay here again and recommend it to friends.",
        "rating": 4.9
    },
    {
        "user_id": "u118",
        "home_id": "Lm3BR4",
        "comment": "The location was convenient, close enough to the city but still quiet and peaceful. We really appreciated the outdoor space, where we could relax in the evenings. The house felt safe and homely, which was important for us traveling with kids. Recommended for families and small groups.",
        "rating": 4.7
    },
    {
        "user_id": "u119",
        "home_id": "gV1",
        "comment": "Waking up to the view of Gran Vía was incredible. The apartment was modern, stylish, and well-kept. We enjoyed being so close to everything and never had to use public transport. I’d recommend it to anyone wanting to fully experience Madrid.",
        "rating": 5.0
    },
    {
        "user_id": "u120",
        "home_id": "gV1",
        "comment": "The location could not be better, and the apartment itself was spotless. It felt like living in a boutique hotel with all the comforts of home. The host even left us a bottle of wine, which we appreciated. Definitely recommend this place for couples and city explorers.",
        "rating": 4.9
    },
    {
        "user_id": "u121",
        "home_id": "gV1",
        "comment": "Beautifully decorated with modern touches and very comfortable furniture. The view was truly breathtaking, especially in the evenings. The place felt safe and welcoming throughout our stay. Highly recommend for anyone wanting both style and convenience.",
        "rating": 4.8
    },
    {
        "user_id": "u122",
        "home_id": "gV1",
        "comment": "The best part was definitely the location. Everything was right outside our door, from shopping to restaurants. The apartment was clean and quiet despite being in such a lively area. I’d recommend it to friends without hesitation.",
        "rating": 4.7
    },
    {
        "user_id": "u123",
        "home_id": "gV1",
        "comment": "Stylish apartment in the heart of the city, and the view was a bonus. We loved having coffee on the balcony in the mornings. The host was attentive and easy to communicate with. Recommended for couples or solo travelers looking for comfort and elegance.",
        "rating": 4.9
    },
    {
        "user_id": "u124",
        "home_id": "Rk8MN2",
        "comment": "Very clean and modern, with all the amenities we needed. The Wi-Fi was excellent, which helped me keep up with work during our stay. The area was safe and quiet, making it easy to relax. Definitely recommend for remote workers or couples.",
        "rating": 4.8
    },
    {
        "user_id": "u125",
        "home_id": "Rk8MN2",
        "comment": "The host was super friendly and always available when we needed advice. The apartment felt fresh and cozy, and the kitchen had everything we required. The neighborhood was calm but still close to shops. A great spot I’d recommend to anyone.",
        "rating": 4.7
    },
    {
        "user_id": "u126",
        "home_id": "Rk8MN2",
        "comment": "What impressed me most was how spotless and well-kept everything was. The bed was comfortable, and the bathroom felt brand new. We enjoyed having easy access to local cafes. Recommended for anyone wanting peace and cleanliness.",
        "rating": 4.9
    },
    {
        "user_id": "u127",
        "home_id": "Rk8MN2",
        "comment": "Nice apartment with a modern feel, and the lighting made it cozy. We stayed for four nights and felt comfortable the entire time. The host was responsive and helpful. I’d recommend it to small families or couples.",
        "rating": 4.6
    },
    {
        "user_id": "u128",
        "home_id": "Rk8MN2",
        "comment": "We had a smooth check-in and found everything just as described. The furniture was new, and the atmosphere was relaxing. I appreciated the quiet environment after busy days in the city. Definitely recommended for travelers who like comfort and calm.",
        "rating": 4.8
    },
    {
        "user_id": "u129",
        "home_id": "Fo7IG9",
        "comment": "Such a charming place with thoughtful touches everywhere. The host clearly cares about the guests' experience. The apartment was spotless and smelled fresh. Highly recommend it for anyone who appreciates small details and comfort.",
        "rating": 4.9
    },
    {
        "user_id": "u130",
        "home_id": "Fo7IG9",
        "comment": "Perfectly located apartment with easy access to public transport. The rooms were bright and inviting. We felt safe and comfortable throughout our stay. Recommended to both business and leisure travelers.",
        "rating": 4.8
    },
    {
        "user_id": "u131",
        "home_id": "Lm3BR4",
        "comment": "The house had a very welcoming atmosphere. We enjoyed cooking in the well-equipped kitchen and eating together in the spacious dining area. The beds were soft and cozy, making every night restful. Great place for families looking for a home-like stay.",
        "rating": 4.7
    },
    {
        "user_id": "u132",
        "home_id": "Lm3BR4",
        "comment": "Quiet surroundings and a very clean interior. The host made sure everything was ready before we arrived, and it showed. The kids loved the extra space to move around. I would definitely recommend it for family trips.",
        "rating": 4.6
    },
    {
        "user_id": "u133",
        "home_id": "gV1",
        "comment": "Unbeatable location and fantastic views. The apartment was clean, stylish, and very well organized. We felt like we were right in the center of the action, but still had peace inside. Recommended for city lovers.",
        "rating": 5.0
    },
    {
        "user_id": "u134",
        "home_id": "gV1",
        "comment": "The design of the apartment was elegant, with every detail carefully chosen. We enjoyed the evenings with the city lights glowing outside the window. The atmosphere was romantic and calm. Perfect for couples wanting a special trip.",
        "rating": 4.9
    },
    {
        "user_id": "u135",
        "home_id": "Rk8MN2",
        "comment": "Everything was just as described, maybe even better. The apartment was neat, quiet, and very comfortable. The Wi-Fi and heating worked perfectly during our stay. I’d recommend it to anyone looking for a reliable place to stay.",
        "rating": 4.8
    },
    {
        "user_id": "u136",
        "home_id": "Rk8MN2",
        "comment": "Great host, very responsive and helpful. The apartment felt brand new and was sparkling clean. We appreciated the cozy decor that made it feel inviting. Recommended for both solo travelers and couples.",
        "rating": 4.7
    }
]