[
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "The apartment was clean and cozy, with everything we needed for a weekend stay. The kitchen was well equipped and allowed us to cook a couple of meals easily. We especially enjoyed the quiet at night, which made sleeping very comfortable. I would highly recommend it to couples looking for a calm and convenient place in the city.",
        "rating": 4.8,
        "createdAt": 1687420800000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Loved the modern design and central location, everything was within walking distance. The host was very responsive and gave us great tips for restaurants nearby. The bed was comfortable, and the Wi-Fi was reliable, which was perfect since I had to work a bit during the stay. I’d recommend it to anyone who wants a stylish and practical spot in town.",
        "rating": 4.9,
        "createdAt": 1690109200000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "Spacious rooms and a warm host made our stay really pleasant. The neighborhood was quiet, and we always felt safe walking around even at night. The living room was large enough for our kids to play in, which made it stress-free for us as parents. It’s definitely a great choice for families who want comfort and peace of mind.",
        "rating": 4.7,
        "createdAt": 1692797600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "The place was bright and airy, with lots of natural light in the mornings. We loved having easy access to public transport, which made sightseeing effortless. The host even left us a small welcome gift, which was a really nice touch. I’d recommend this home for business travelers or families who want space without sacrificing convenience.",
        "rating": 4.6,
        "createdAt": 1695389600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "Amazing view of Gran Vía! We enjoyed breakfast on the balcony every morning and watched the city come alive. The interior was stylish yet cozy, and it truly felt like a boutique stay. I would absolutely recommend this apartment to couples looking for romance in the heart of Madrid.",
        "rating": 5.0,
        "createdAt": 1698071600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "The apartment was comfortable and beautifully decorated, with lots of attention to detail. The location could not have been better, we had theaters, shops, and restaurants all around us. The bed was super soft, and we slept wonderfully each night. I would recommend it to anyone who wants to experience the real energy of the city while still having a relaxing retreat.",
        "rating": 4.9,
        "createdAt": 1700750000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "Very clean and well-maintained, with everything working perfectly. The host was welcoming and made sure we felt at home from the very first moment. We stayed for almost a week and it was comfortable the entire time. This home is a fantastic option for longer stays where you want both reliability and warmth.",
        "rating": 4.8,
        "createdAt": 1703428400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "Nice place with modern amenities, and the fast Wi-Fi was a big plus for me since I was working remotely. The neighborhood was quiet, but we could still find cafes and shops nearby within a short walk. Everything felt very new and clean, and the bathroom was especially nice. I would recommend it to digital nomads or anyone who values comfort and functionality.",
        "rating": 4.7,
        "createdAt": 1706106800000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "The apartment felt like home from the moment we walked in. Everything was spotless, and the design was thoughtful with small touches that made a big difference. We really appreciated the extra blankets since it got chilly at night. I’d highly recommend this place to anyone who values comfort and cleanliness.",
        "rating": 4.8,
        "createdAt": 1708785200000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Location was absolutely perfect, close to shops, cafes, and the main attractions. The bed was very comfortable, and the living room was spacious enough for us to relax after sightseeing. We felt like locals thanks to the great neighborhood vibe. Definitely recommend it for travelers wanting both comfort and convenience.",
        "rating": 4.9,
        "createdAt": 1711463600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "Very spacious, clean, and perfect for our family trip. The kids loved having their own rooms and space to play. The kitchen had everything we needed, and we even cooked a couple of meals together. I would definitely recommend it for families who want space and comfort.",
        "rating": 4.8,
        "createdAt": 1714055600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "The place was bright and comfortable, with easy access to the train station. It was convenient for our daily sightseeing trips. The host was kind and checked in with us to make sure everything was going well. A very reliable option for short or long stays.",
        "rating": 4.6,
        "createdAt": 1716734000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "Incredible views of the city! Every morning we had coffee while looking out at Gran Vía. The home was decorated beautifully, with modern touches that made it feel luxurious. Definitely a must-stay for couples.",
        "rating": 5.0,
        "createdAt": 1719326000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "The apartment was cozy and welcoming. We loved the location, right in the middle of the theater district, with shops and restaurants everywhere. The host gave us amazing local tips, which made the trip even better.",
        "rating": 4.9,
        "createdAt": 1722004400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "Super clean and very comfortable. The host was responsive and always available when we had questions. We stayed for a week and felt at home the whole time. Highly recommend it for long stays!",
        "rating": 4.8,
        "createdAt": 1724682800000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "The apartment felt brand new, everything worked perfectly. The location was quiet, but still close enough to shops and cafes. Great choice for anyone working remotely or traveling with family.",
        "rating": 4.7,
        "createdAt": 1727361200000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Lovely stay. The host was thoughtful and left us wine and snacks on arrival. The interior design was beautiful, and we felt right at home. Would recommend it to anyone who loves stylish apartments.",
        "rating": 4.9,
        "createdAt": 1730039600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Perfectly located, with comfortable beds and a clean bathroom. We really enjoyed being able to walk everywhere. Great option for city travelers!",
        "rating": 4.8,
        "createdAt": 1732718000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "This home was ideal for our family. Spacious, bright, and equipped with everything we needed. The host made sure we had a crib and high chair for the kids, which was really thoughtful.",
        "rating": 4.7,
        "createdAt": 1735309200000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "Very quiet neighborhood, safe and peaceful. The living area was great for relaxing in the evenings. I’d definitely book it again if I come back.",
        "rating": 4.6,
        "createdAt": 1737987600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "Romantic spot with stunning views of Madrid. Perfect for couples looking for a stylish getaway. Everything was clean and well maintained.",
        "rating": 5.0,
        "createdAt": 1740666000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "The host was so kind and helpful. The home was beautiful, and the location made it easy to explore Madrid’s nightlife and attractions. Would absolutely stay here again.",
        "rating": 4.9,
        "createdAt": 1743344400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "Spotlessly clean, comfortable, and well-equipped. The host was professional and welcoming. Perfect for long-term stays, as everything was provided.",
        "rating": 4.8,
        "createdAt": 1745936400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "Modern apartment in a quiet area, but still close to transport. Great Wi-Fi, comfortable bed, and plenty of natural light. Perfect for digital nomads.",
        "rating": 4.7,
        "createdAt": 1748614800000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Fantastic location, everything was within walking distance. The apartment was clean and stylish. The host was very kind and responsive.",
        "rating": 4.9,
        "createdAt": 1751293200000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Bright, comfortable, and nicely decorated. We felt at home and enjoyed our time there. Would definitely recommend it to friends and family.",
        "rating": 4.8,
        "createdAt": 1753971600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "The apartment was spacious and quiet. The host made sure we had everything we needed, including extra towels and toiletries. Great experience overall.",
        "rating": 4.7,
        "createdAt": 1756562800000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "Very cozy and relaxing. We enjoyed our evenings in the living room after sightseeing. The kitchen was fully equipped, which was a big plus.",
        "rating": 4.6,
        "createdAt": 1759241200000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "The view alone makes this apartment worth it! Beautifully decorated and very comfortable. I would highly recommend it to anyone visiting Madrid.",
        "rating": 5.0,
        "createdAt": 1761919600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb71",
        "comment": "Excellent stay. Everything was as described, clean, and well located. The host was very attentive. Would book again for sure.",
        "rating": 4.9,
        "createdAt": 1764598000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "We stayed for almost a week, and it was perfect. Very comfortable, quiet, and clean. The host was attentive and made our stay easy.",
        "rating": 4.8,
        "createdAt": 1767276400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb72",
        "comment": "The apartment felt brand new, with modern amenities and a quiet location. The bed was very comfortable. A great stay overall.",
        "rating": 4.7,
        "createdAt": 1769867600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Everything about this apartment was perfect: location, cleanliness, and style. The host was very welcoming. Would definitely stay again.",
        "rating": 4.9,
        "createdAt": 1772546000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb6c",
        "comment": "Great location and very comfortable stay. We enjoyed the cozy decor and felt at home immediately. Highly recommended.",
        "rating": 4.8,
        "createdAt": 1775224400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "The home was spacious and well equipped. Perfect for our family trip. The host was helpful and accommodating.",
        "rating": 4.7,
        "createdAt": 1777815600000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb70",
        "comment": "We had a very comfortable stay. The apartment was clean, bright, and located in a safe neighborhood. Would recommend it to families.",
        "rating": 4.6,
        "createdAt": 1780494000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb73",
        "comment": "Absolutely amazing view and very stylish apartment. It felt like a boutique hotel. Perfect for couples visiting Madrid.",
        "rating": 5.0,
        "createdAt": 1783172400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb73",
        "comment": "The apartment was clean, comfortable, and perfectly located. The host was friendly and gave us lots of tips for our stay. Great experience.",
        "rating": 4.9,
        "createdAt": 1785850800000
    },
    {
        "user_id": "68c242e0ac0d57e02713467e",
        "home_id": "68c2565f7ef75d132ee4eb73",
        "comment": "Fantastic apartment, very clean and quiet. The host was professional and attentive. Great choice for long stays.",
        "rating": 4.8,
        "createdAt": 1788442000000
    },
    {
        "user_id": "68c242e0ac0d57e02713467f",
        "home_id": "68c2565f7ef75d132ee4eb73",
        "comment": "Great host, very responsive and helpful. The apartment felt brand new and was sparkling clean. We appreciated the cozy decor that made it feel inviting. Recommended for both solo travelers and couples.",
        "rating": 4.7,
        "createdAt": 1791120400000
    },
    {
        "user_id": "68c242e0ac0d57e02713467c",
        "home_id": "68c2565f7ef75d132ee4eb73",
        "comment": "Perfect location with everything nearby. The apartment was clean, stylish, and very comfortable. Would definitely stay again.",
        "rating": 4.9,
        "createdAt": 1793798800000
    },
    {
        "user_id": "68c242e0ac0d57e02713467d",
        "home_id": "68c2565f7ef75d132ee4eb73",
        "comment": "Very cozy and well decorated. We loved the convenience of the location and the warmth of the host. Highly recommended for couples.",
        "rating": 4.8,
        "createdAt": 1796477200000
    }
]